'''
Задача №2939. Дележ яблок - 2
N школьников делят K яблок поровну, неделящийся остаток остается в корзинке. 
Сколько яблок останется в корзинке?
14%3=2
Ввод: 3
      14
Вывод:2
'''
x1=int(input())
x2=int(input())
sum=x2%x1
print(sum)