'''
Задача №3449. Python.
Запишите слово 'Python' 100 раз подряд. 
Сдайте на проверку программу, которая выводит эту строчку(только буквы, без кавычек).
'''
text='Python'
n=100
print(text*n)