#Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.
import math
n=(int(input()))
m=(int(input()))
ans=((n*n)+(m*m))
sum=ans
print(pow(sum,0.5))