#Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.
import math
n=(int(input()))
m=(int(input()))
ans=(math.sqrt((n*n)+(m*m)))
print(ans)