'''
Задача №2941. Последняя цифра
Дано натуральное число. Выведите его последнюю цифру.
ввод: 179
вывод: 9
'''
x=int(input())
print(x%10)