'''
Задача №3443. Степень двойки.
Вычислите 2^179. Выведите на экран вычисленное значение.
'''
print(pow(2,179))