'''
Задача №2942. Число десятков двузначного числа
Дано двузначное число. Найдите число десятков в нем.
ввод: 41
вывод: 4
'''
x=int(input())
print(x//10)