'''
Задача №3448. 100А
Запишите букву 'A' (латинскую, заглавную) 100 раз подряд. 
Сдайте на проверку программу, которая выводит эту строчку(только буквы, без кавычек).
'''
text='A'
n=100
print(text*n)
