
'''
Задача №3445. Гипотенуза.
Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
'''
import math

ans=(math.sqrt((179*179)+(971*971)))
print(ans)
