'''
Задача №3450. Квадрат числа.
Число 179 записали 50 раз подряд. 
Полученное 150-значное число возвели в квадрат. Сколько получилось?
'''
sum=int(str(179)*50)
print(pow(sum,2))
