'''
Задача №3451. Корень степени 10.
Число 17910 записали четыре раза подряд. 
Из получившегося числа извлекли корень степени 10. Сколько получилось?
'''
sum=str(179**10)
sum2=int(sum*4)
print(pow(sum2,0.1))
