'''
Задача №2938. Дележ яблок - 1
N школьников делят K яблок поровну, неделящийся остаток остается в корзинке. 
Сколько яблок достанется каждому школьнику?
14/3=4
Ввод: 3
      14
Вывод:4
'''
x1=int(input())
x2=int(input())
sum=x2//x1
print(sum)
